stxent/halm/lpc17xx/uart.c
/*
 * uart.c
 * Copyright (C) 2012 xent
 * Project is distributed under the terms of the GNU General Public License v3.0
 */

#include <stdlib.h>
/*----------------------------------------------------------------------------*/
#include "uart.h"
#include "lpc17xx_defines.h"
#include "lpc17xx_sys.h"
/*----------------------------------------------------------------------------*/
#define FIFO_SIZE                       8
#define DEFAULT_DIV                     PCLK_DIV1
#define DEFAULT_DIV_VALUE               1
/*----------------------------------------------------------------------------*/
/* UART register bits */
/* IrDA, Modem signals, auto-baud and RS-485 not used */
/*------------------Line Control Register-------------------------------------*/
#define LCR_WORD_5BIT                   (0 << 0)
#define LCR_WORD_6BIT                   (1 << 0)
#define LCR_WORD_7BIT                   (2 << 0)
#define LCR_WORD_8BIT                   (3 << 0)
#define LCR_STOP_1BIT                   (0 << 2)
#define LCR_STOP_2BIT                   (1 << 2)
#define LCR_PARITY                      BIT(3)
#define LCR_PARITY_ODD                  (0 << 4)
#define LCR_PARITY_EVEN                 (1 << 4)
#define LCR_BREAK                       BIT(6)
#define LCR_DLAB                        BIT(7)
/*------------------Interrupt Enable Register---------------------------------*/
#define IER_RBR                         BIT(0)
#define IER_THRE                        BIT(1)
#define IER_RX_LINE                     BIT(2)
/*------------------Interrupt Identification Register-------------------------*/
#define IIR_INT_STATUS                  BIT(0) /* Status, active low */
#define IIR_INT_MASK                    (0x07 << 1)
#define IIR_INT_RLS                     (3 << 1) /* Receive line status */
#define IIR_INT_RDA                     (2 << 1) /* Receive data available */
#define IIR_INT_CTI                     (6 << 1) /* Character timeout */
#define IIR_INT_THRE                    (1 << 1) /* THRE interrupt */
/*------------------FIFO Control Register-------------------------------------*/
#define FCR_ENABLE                      BIT(0)
#define FCR_RX_RESET                    BIT(1)
#define FCR_TX_RESET                    BIT(2)
/*
 * Level 0:  1 character
 * Level 1:  4 characters
 * Level 2:  8 characters
 * Level 3: 14 characters
 */
#define FCR_RX_TRIGGER(level)           ((level) << 6)
/*------------------Line Status Register--------------------------------------*/
#define LSR_RDR                         BIT(0) /* Receiver data ready */
#define LSR_OE                          BIT(1) /* Overrun error */
#define LSR_PE                          BIT(2) /* Parity error */
#define LSR_FE                          BIT(3) /* Framing error */
#define LSR_BI                          BIT(4) /* Break interrupt */
/* Transmitter holding register empty */
#define LSR_THRE                        BIT(5)
#define LSR_TEMT                        BIT(6) /* Transmitter empty */
#define LSR_RXFE                        BIT(7) /* Error in RX FIFO */
/*------------------Transmit Enable Register----------------------------------*/
#define TER_TXEN                        BIT(7) /* Transmit enable */
/*----------------------------------------------------------------------------*/
/* UART pin function values */
static const struct GpioPinFunc uartPins[] = {
    {
        .key = GPIO_TO_PIN(0, 0),
        .func = 0x02
    },
    {
        .key = GPIO_TO_PIN(0, 1),
        .func = 0x02
    },
    {
        .key = GPIO_TO_PIN(0, 2),
        .func = 0x01
    },
    {
        .key = GPIO_TO_PIN(0, 3),
        .func = 0x01
    },
    {
        .key = GPIO_TO_PIN(0, 10),
        .func = 0x01
    },
    {
        .key = GPIO_TO_PIN(0, 11),
        .func = 0x01
    },
    {
        .key = GPIO_TO_PIN(0, 15),
        .func = 0x01
    },
    {
        .key = GPIO_TO_PIN(0, 16),
        .func = 0x01
    },
    {
        .key = GPIO_TO_PIN(0, 25),
        .func = 0x03
    },
    {
        .key = GPIO_TO_PIN(0, 26),
        .func = 0x03
    },
    {
        .key = GPIO_TO_PIN(2, 0),
        .func = 0x02
    },
    {
        .key = GPIO_TO_PIN(2, 1),
        .func = 0x02
    },
    {
        .key = GPIO_TO_PIN(2, 8),
        .func = 0x02
    },
    {
        .key = GPIO_TO_PIN(2, 9),
        .func = 0x02
    },
    {
        .key = GPIO_TO_PIN(4, 28),
        .func = 0x03
    },
    {
        .key = GPIO_TO_PIN(4, 29),
        .func = 0x03
    },
    {
        .key = -1,
        .func = 0x00
    }
};
/*----------------------------------------------------------------------------*/
const enum dmaLine dmaTxLines[] = {
    DMA_LINE_UART0_TX,
    DMA_LINE_UART1_TX,
    DMA_LINE_UART2_TX,
    DMA_LINE_UART3_TX
};
/*----------------------------------------------------------------------------*/
const enum dmaLine dmaRxLines[] = {
    DMA_LINE_UART0_RX,
    DMA_LINE_UART1_RX,
    DMA_LINE_UART2_RX,
    DMA_LINE_UART3_RX
};
/*----------------------------------------------------------------------------*/
enum cleanup
{
  FREE_NONE = 0,
  FREE_RX_PIN,
  FREE_TX_PIN,
  FREE_RX_QUEUE,
  FREE_TX_QUEUE,
  FREE_MUTEX,
  FREE_ALL
};
/*----------------------------------------------------------------------------*/
static enum result uartInit(struct Interface *, const void *);
static void uartDeinit(struct Interface *);
static unsigned int uartRead(struct Interface *, uint8_t *, unsigned int);
static unsigned int uartWrite(struct Interface *, const uint8_t *,
    unsigned int);
static enum result uartGetOpt(struct Interface *, enum ifOption, void *);
static enum result uartSetOpt(struct Interface *, enum ifOption, const void *);
/*----------------------------------------------------------------------------*/
static void uartBaseHandler(struct Uart *);
static enum result uartSetRate(struct Uart *, uint32_t);
static void uartCleanup(struct Uart *, enum cleanup);
static enum result uartDmaSetup(struct Uart *, int8_t);
/*----------------------------------------------------------------------------*/
static const struct InterfaceClass uartTable = {
    .size = sizeof(struct Uart),
    .init = uartInit,
    .deinit = uartDeinit,

    .read = uartRead,
    .write = uartWrite,
    .getopt = uartGetOpt,
    .setopt = uartSetOpt
};
/*----------------------------------------------------------------------------*/
const struct InterfaceClass *Uart = &uartTable;
/*----------------------------------------------------------------------------*/
static struct Uart *descriptor[] = {0, 0, 0, 0};
/*----------------------------------------------------------------------------*/
static void uartBaseHandler(struct Uart *desc)
{
  uint8_t content, counter;
  if (!desc)
    return;

  /* Interrupt status cleared when performed read operation on IIR register */
  switch (desc->block->IIR & IIR_INT_MASK)
  {
    case IIR_INT_RDA:
      content = desc->block->RBR;
      queuePush(&desc->rxQueue, content);
      break;
    case IIR_INT_THRE:
      /* Fill FIFO with 8 bytes or less */
      counter = 0;
      while (queueSize(&desc->txQueue) && counter++ < FIFO_SIZE)
        desc->block->THR = queuePop(&desc->txQueue);
      if (!queueSize(&desc->txQueue))
        desc->active = false;
      break;
    default:
      break;
  }
}
/*----------------------------------------------------------------------------*/
void UART0_IRQHandler(void)
{
  uartBaseHandler(descriptor[0]);
}
/*----------------------------------------------------------------------------*/
void UART1_IRQHandler(void)
{
  uartBaseHandler(descriptor[1]);
}
/*----------------------------------------------------------------------------*/
void UART2_IRQHandler(void)
{
  uartBaseHandler(descriptor[2]);
}
/*----------------------------------------------------------------------------*/
void UART3_IRQHandler(void)
{
  uartBaseHandler(descriptor[3]);
}
/*----------------------------------------------------------------------------*/
static enum result uartSetRate(struct Uart *device, uint32_t rate)
{
  uint32_t divider;

  divider = (SystemCoreClock / DEFAULT_DIV_VALUE) / (rate << 4);
  if (divider >= (1 << 16) || !divider)
    return E_ERROR;
  //TODO Add fractional divider calculation
  /* Set 8-bit length and enable DLAB access */
  device->block->LCR = LCR_DLAB;
  /* Set divisor of the baud rate generator */
  device->block->DLL = (uint8_t)divider;
  device->block->DLM = (uint8_t)(divider >> 8);
  device->block->LCR &= ~LCR_DLAB; /* Clear DLAB */
  return E_OK;
}
/*----------------------------------------------------------------------------*/
static void uartCleanup(struct Uart *device, enum cleanup step)
{
  switch (step)
  {
    case FREE_ALL:
      if (device->dma)
      {
        dmaDeinit(&device->txDma);
        /* dmaDeinit(&device->rxDma); */
      }
    case FREE_MUTEX:
      mutexDeinit(&device->lock);
    case FREE_TX_QUEUE:
      if (!device->dma)
        queueDeinit(&device->txQueue);
    case FREE_RX_QUEUE:
//      if (!device->dma)
      queueDeinit(&device->rxQueue);
    case FREE_TX_PIN:
      gpioReleasePin(&device->txPin);
    case FREE_RX_PIN:
      gpioReleasePin(&device->rxPin);
      break;
    default:
      break;
  }
}
/*----------------------------------------------------------------------------*/
static enum result uartGetOpt(struct Interface *iface, enum ifOption option,
    void *data)
{
  struct Uart *device = (struct Uart *)iface;

  switch (option)
  {
    case IF_SPEED:
      /* TODO */
      return E_OK;
    case IF_QUEUE_RX:
      *(uint8_t *)data = queueSize(&device->rxQueue);
      return E_OK;
    case IF_QUEUE_TX:
      *(uint8_t *)data = queueSize(&device->txQueue);
      return E_OK;
    default:
      return E_ERROR;
  }
}
/*----------------------------------------------------------------------------*/
static enum result uartSetOpt(struct Interface *iface, enum ifOption option,
    const void *data)
{
  struct Uart *device = (struct Uart *)iface;
  uint32_t rate;

  switch (option)
  {
    case IF_SPEED:
      rate = *(uint32_t *)data;
      return uartSetRate(device, rate);
    default:
      return E_ERROR;
  }
}
/*----------------------------------------------------------------------------*/
static unsigned int uartRead(struct Interface *iface, uint8_t *buffer,
    unsigned int length)
{
  struct Uart *device = (struct Uart *)iface;
  int read = 0;

  mutexLock(&device->lock);
  while (queueSize(&device->rxQueue) && read++ < length)
  {
    NVIC_DisableIRQ(device->irq);
    *buffer++ = queuePop(&device->rxQueue);
    NVIC_EnableIRQ(device->irq);
  }
  mutexUnlock(&device->lock);
  return read;
}
/*----------------------------------------------------------------------------*/
static unsigned int uartWrite(struct Interface *iface, const uint8_t *buffer,
    unsigned int length)
{
  struct Uart *device = (struct Uart *)iface;
  int written = 0;

  if (device->dma)
  {
    if (dmaStart(&device->txDma, (void *)buffer,
        (void *)&device->block->THR, length) == E_OK)
    {
      /* Wait until all bytes transferred */
      while (dmaIsActive(&device->txDma));
    }
    /* TODO Add DMA error handling */
    return length;
  }
  else
  {
    mutexLock(&device->lock);
    if (!device->active)
    {
      device->active = true;
      device->block->THR = *buffer++;
      written++;
    }
    while (!queueFull(&device->txQueue) && written++ < length)
    {
      NVIC_DisableIRQ(device->irq);
      queuePush(&device->txQueue, *buffer++);
      NVIC_EnableIRQ(device->irq);
    }
    mutexUnlock(&device->lock);
    return written;
  }
}
/*----------------------------------------------------------------------------*/
static void uartDeinit(struct Interface *iface)
{
  struct Uart *device = (struct Uart *)iface;

  /* Disable interrupt */
  NVIC_DisableIRQ(device->irq);
  /* Reset UART descriptor */
  descriptor[device->channel] = 0;
  /* Processor-specific register */
  LPC_SC->PCONP &= ~PCONP_PCUART0;
  /* Release resources */
  uartCleanup(device, FREE_ALL);
}
/*----------------------------------------------------------------------------*/
static enum result uartDmaSetup(struct Uart *device, int8_t channel)
{
  struct DmaConfig dmaTxConfig = {
      .source = {
          .line = DMA_LINE_MEMORY,
          .increment = true
      },
      .destination = {
          .line = dmaTxLines[device->channel],
          .increment = false
      },
      .burst = DMA_BURST_1,
      .width = DMA_WIDTH_BYTE,
      .direction = DMA_DIR_M2P,
      .channel = channel
  };

  if (dmaInit(&device->txDma, &dmaTxConfig) != E_OK)
    return E_ERROR;
  /* TODO Add RX line */
}
/*----------------------------------------------------------------------------*/
static enum result uartInit(struct Interface *iface, const void *cdata)
{
  /* Set pointer to device configuration data */
  struct UartConfig *config = (struct UartConfig *)cdata;
  struct Uart *device = (struct Uart *)iface;
  uint8_t rxFunc, txFunc;

  /* Check device configuration data and availability */
  if (!config || config->channel > 3 || descriptor[config->channel])
    return E_ERROR;

  device->dma = config->dma.enabled;

  /* Check pin mapping */
  rxFunc = gpioFindFunc(uartPins, config->rx);
  txFunc = gpioFindFunc(uartPins, config->tx);
  if (!rxFunc || !txFunc)
    return E_ERROR;

  /* Setup UART pins */
  device->rxPin = gpioInitPin(config->rx, GPIO_INPUT);
  if (gpioGetKey(&device->rxPin) == -1)
    return E_ERROR;

  device->txPin = gpioInitPin(config->tx, GPIO_OUTPUT);
  if (gpioGetKey(&device->txPin) == -1)
  {
    uartCleanup(device, FREE_RX_PIN);
    return E_ERROR;
  }

  /* Initialize RX and TX queues */
  /* TODO Add DMA handling: do not use RX queue */
  if (queueInit(&device->rxQueue, config->rxLength) != E_OK)
  {
    uartCleanup(device, FREE_TX_PIN);
    return E_ERROR;
  }

  if (!device->dma && queueInit(&device->txQueue, config->txLength) != E_OK)
  {
    uartCleanup(device, FREE_RX_QUEUE);
    return E_ERROR;
  }

  /* Initialize mutex */
  if (mutexInit(&device->lock) != E_OK)
  {
    uartCleanup(device, FREE_TX_QUEUE);
    return E_ERROR;
  }

  /* Initialize DMA */
  if (device->dma && uartDmaSetup(device, config->dma.channel) != E_OK)
  {
    uartCleanup(device, FREE_MUTEX);
    return E_ERROR;
  }

  device->active = false;
  device->channel = config->channel;

  //FIXME rewrite definitions, fix TER size
  switch (config->channel)
  {
    case 0:
      LPC_SC->PCONP |= PCONP_PCUART0;
      sysSetPeriphDiv(PCLK_UART0, DEFAULT_DIV);
      device->block = (LPC_UART_TypeDef *)LPC_UART0; //FIXME
      device->irq = UART0_IRQn;
      break;
    case 1:
      LPC_SC->PCONP |= PCONP_PCUART1;
      sysSetPeriphDiv(PCLK_UART1, DEFAULT_DIV);
      device->block = (LPC_UART_TypeDef *)LPC_UART1; //FIXME
      device->irq = UART1_IRQn;
      break;
    case 2:
      LPC_SC->PCONP |= PCONP_PCUART2;
      sysSetPeriphDiv(PCLK_UART2, DEFAULT_DIV);
      device->block = LPC_UART2;
      device->irq = UART2_IRQn;
      break;
    case 3:
      LPC_SC->PCONP |= PCONP_PCUART3;
      sysSetPeriphDiv(PCLK_UART3, DEFAULT_DIV);
      device->block = LPC_UART3;
      device->irq = UART3_IRQn;
      break;
    default:
      break;
  }

  if (uartSetRate(device, config->rate) != E_OK)
  {
    uartCleanup(device, FREE_ALL);
    return E_ERROR;
  }

  /* Select the UART function of pins */
  gpioSetFunc(&device->rxPin, rxFunc);
  gpioSetFunc(&device->txPin, txFunc);

  /* Set 8-bit length */
  device->block->LCR = LCR_WORD_8BIT;
  /* Enable and clear FIFO */
  device->block->FCR = FCR_ENABLE;
  /* Enable RBR and THRE interrupts */
#ifdef UART_DMA
  /* TODO disable interrupts when using DMA */
  device->block->IER = IER_RBR;
  if (!device->dma)
    device->block->IER |= IER_THRE;
#else
  device->block->IER |= IER_RBR | IER_THRE;
#endif
  device->block->TER = TER_TXEN;

  descriptor[config->channel] = device;
  NVIC_EnableIRQ(device->irq); /* Enable interrupt */
  NVIC_SetPriority(device->irq, GET_PRIORITY(config->priority));
  return E_OK;
}
